validation/skewed_cavity/of_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  13
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          incompressibleFluid;

startFrom       startTime;
startTime       0;

stopAt          endTime;
// Steady SIMPLE: each "time step" is one outer iteration. The run stops early
// when residualControl (fvSolution) is met; endTime caps the outer-iteration
// count.
endTime         2000;
deltaT          1;

writeControl    timeStep;
writeInterval   5000;   // the converged field is auto-written when SIMPLE stops
purgeWrite      0;

writeFormat     ascii;  // ASCII so aquaflux's reader can parse mesh + fields
writePrecision  12;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
